Revit 2024 API
AnalysisMode Enumeration
 This enum is used to define the Energy Analysis Model.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public enum AnalysisMode
Visual Basic
Public Enumeration AnalysisMode
Visual C++
public enum class AnalysisMode
Members
Member name | Description
BuildingElements |  Energy Analysis Model based on building elements.
ConceptualMassesAndBuildingElements |  Energy Analysis Model based on conceptual masses and building elements.
RoomsOrSpaces |  Energy Analysis Model based on spatial elements. This mode uses volumes based on rooms or spaces defined in the building model.
See Also
Autodesk.Revit.DB.Analysis Namespace